Musharafali108/STM32F429-Projects/UART_Trans/Src/main.c
#include<stdint.h>
#include "stm32f4xx.h"

#define GPIOAEN			(1<<0)
#define USART1EN		(1<<4)

#define CR1_TE			(1<<3)
#define CR1_UE			(1<<13)
#define SR_TXE			(1<<7)

#define SYS_FREQ		16000000
#define APB1_CLK		SYS_FREQ

#define UART_BAUDRATE	115200

static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk,  uint32_t BaudRate);
static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate);
void uart1_write(char ch);
void uart1_tx_init(void);

int main(void)
{
	uart1_tx_init();

	while(1)
	{
		uart1_write('M');

	}
}

void uart1_tx_init(void)
{
	/****************Configure uart gpio pin***************/
	/*Enable clock access to gpioa */
	RCC->AHB1ENR |= GPIOAEN;

	/*Set PA9 mode to alternate function mode*/
	GPIOA->MODER &= ~(1<<18);
	GPIOA->MODER |= (1<<19);

	/*Set PA9 alternate function type to UART_TX (AF07)*/
	GPIOA->AFR[1] |= (1<<4);
	GPIOA->AFR[1] |= (1<<5);
	GPIOA->AFR[1] |= (1<<6);
	GPIOA->AFR[1] &= ~(1<<7);

	/****************Configure uart module ***************/
	/*Enable clock access to uart1 */
	RCC->APB2ENR |= USART1EN;

	/*Configure baudrate*/
	uart_set_baudrate(USART1,APB1_CLK,UART_BAUDRATE);

	/*Configure the transfer direction*/
	USART1->CR1 = CR1_TE;

	/*Enable uart module*/
	USART1->CR1 |= CR1_UE;

}

void uart1_write(char ch)
{
  /*Make sure the transmit data register is empty*/
	while(!(USART1->SR & SR_TXE)){}		//USART_SR

  /*Write to transmit data register*/
	USART1->DR	=  (ch & 0xFF);
}

static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk,  uint32_t BaudRate)
{
	USARTx->BRR =  compute_uart_bd(PeriphClk,BaudRate);
}

static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate)
{
	return ((PeriphClk + (BaudRate/2U))/BaudRate);
}


